export default function Privacy() {
    return (
        <div className="flex justify-center">
            <div className="flex w-11/12 flex-col lg:w-1/2 justify-center lg:px-5 py-20 dark:text-slate-100">
                <span>Политика обработки персональных данных</span>
                <span>1. Общие положения</span>
                <span>1.1. Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона №152-ФЗ «О персональных данных» и определяет порядок обработки персональных данных и меры по обеспечению их безопасности.</span>
                <span>1.2. Политика применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта https://ONVIBE.FUN.</span>
                <span>2. Основные понятия</span>
                <span>2.1. Автоматизированная обработка персональных данных: обработка с помощью средств вычислительной техники.</span>
                <span>2.2. Блокирование персональных данных: временное прекращение обработки персональных данных.</span>
                <span>2.3. Веб-сайт: совокупность графических и информационных материалов, доступных по адресу https://ONVIBE.FUN.</span>
                <span>2.4. Информационная система персональных данных: совокупность данных и технических средств их обработки.</span>
                <span>2.5. Обезличивание персональных данных: действия, в результате которых невозможно определить принадлежность персональных данных конкретному лицу.</span>
                <span>2.6. Обработка персональных данных: любые действия с персональными данными.</span>
                <span>2.7. Оператор: лицо, осуществляющее обработку персональных данных.</span>
                <span>2.8. Персональные данные: информация, относящаяся к определенному лицу.</span>
                <span>2.9. Пользователь: посетитель веб-сайта https://ONVIBE.FUN.</span>
                <span>2.10. Предоставление персональных данных: раскрытие персональных данных определенному лицу.</span>
                <span>2.11. Распространение персональных данных: передача персональных данных неопределенному кругу лиц.</span>
                <span>2.12. Трансграничная передача персональных данных: передача персональных данных за пределы государства.</span>
                <span>2.13. Уничтожение персональных данных: действия, в результате которых персональные данные уничтожаются безвозвратно.</span>
                <span>3. Обработка персональных данных</span>
                <span>3.1. Персональные данные Пользователя могут включать фамилию, имя, отчество, электронный адрес, номера телефонов и прочее.</span>
                <span>3.2. На сайте также происходит сбор и обработка обезличенных данных о посетителях с помощью сервисов интернет-статистики.</span>
                <span>4. Цели обработки персональных данных</span>
                <span>4.1. Целью обработки персональных данных является информирование Пользователя и предоставление доступа к сервисам веб-сайта.</span>
                <span>4.2. Оператор имеет право отправлять уведомления о новых продуктах и услугах, специальных предложениях и событиях, при этом Пользователь может отказаться от получения такой информации.</span>
                <span>4.3. Обезличенные данные используются для анализа действий Пользователей на сайте и улучшения его качества.</span>
                <span>5. Правовые основания обработки персональных данных</span>
                <span>5.1. Оператор обрабатывает персональные данные Пользователя только при их заполнении и отправке через специальные формы на сайте https://ONVIBE.FUN. Пользователь, заполняя формы и/или отправляя свои данные, выражает согласие с настоящей Политикой.</span>
                <span>5.2. Обезличенные данные о Пользователе обрабатываются в случае, если это разрешено в настройках его браузера (включено сохранение файлов «cookie» и использование технологии JavaScript).</span>
                <span>6. Порядок обработки персональных данных.</span>
                <span>6.1. Оператор обеспечивает безопасность персональных данных путем применения правовых, организационных и технических мер, соответствующих требованиям законодательства.</span>
                <span>6.2. Персональные данные не передаются третьим лицам, за исключением случаев, предусмотренных законодательством.</span>
                <span>6.3. Пользователь имеет право на актуализацию своих персональных данных, направив Оператору соответствующее уведомление.</span>
                <span>6.4. Срок обработки персональных данных неограничен. Пользователь вправе в любой момент отозвать свое согласие на обработку персональных данных.</span>
                <span>7. Трансграничная передача персональных данных</span>
                <span>7.1. Перед трансграничной передачей персональных данных Оператор убеждается в надежной защите прав субъектов данных со стороны иностранных государств.</span>
                <span>7.2. Трансграничная передача персональных данных в государства, не соответствующие указанным требованиям, осуществляется только с согласия субъекта данных или в рамках исполнения договора.</span>
                <span>8. Заключительные положения</span>
                <span>8.1. Пользователь может обратиться к Оператору для получения разъяснений по вопросам обработки его персональных данных.</span>
                <span>8.2. В данном документе отражаются любые изменения в политике обработки персональных данных Оператором. Политика действует бессрочно до замены новой версией.</span>
                <span>8.3. Актуальная версия Политики доступна по адресу https://ONVIBE.FUN.</span>
            </div>
        </div>
    )
}