export default function Terms() {
    return (
        <div className="flex justify-center">
            <div className="flex w-11/12 flex-col lg:w-1/2 justify-center lg:px-5 py-20 gap-y-10">
                <div className="flex flex-col gap-y-3">
                    <span className="dark:text-slate-100 font-bold text-lg">ПУБЛИЧНАЯ ОФЕРТА</span>
                    <span className="dark:text-slate-200 text-base">о заключении договора купли-продажи</span>
                </div>
                <div className="flex flex-col gap-y-3">
                    <span className="dark:text-slate-100 font-bold text-xl">Общие положения</span>
                    <span className="dark:text-slate-200 text-base">Настоящая Публичная оферта представляет собой предложение о заключении Договора купли-продажи (далее - &quot;Договор купли-продажи&quot; или &quot;Договор&quot;) между Продавцом и заинтересованным лицом. Принятие предложения является подтверждением согласия обеих Сторон заключить Договор купли-продажи на условиях, изложенных в настоящей Оферте. Публичная оферта является официальным предложением Продавца, адресованным заинтересованным лицам, и соответствует положениям пункта 2 статьи 437 Гражданского кодекса РФ. Договор купли-продажи считается заключенным и вступает в силу с момента совершения Сторонами действий, предусмотренных в настоящей Оферте, и означающих безоговорочное и полное принятие всех условий Оферты без каких-либо изъятий или ограничений на условиях присоединения.</span>
                </div>
                <div className="flex flex-col gap-y-3">
                    <span className="dark:text-slate-100 font-bold text-xl">Термины и определения:</span>
                    <span className="dark:text-slate-200 text-base">Договор - это текст настоящей Оферты с Приложениями, которые являются неотъемлемой частью Оферты, и которые были акцептованы Покупателем путем совершения конклюдентных действий, предусмотренных настоящей Офертой. Конклюдентные действия - это поведение, которое выражает согласие с предложением контрагента заключить, изменить или расторгнуть договор. Действия состоят в полном или частичном выполнении условий, которые предложил контрагент. Сайт Продавца в сети &quot;Интернет&quot; - это совокупность программ для электронных вычислительных машин и иной информации, содержащейся в информационной системе, доступ к которой обеспечивается посредством сети &quot;Интернет&quot; по доменному имени и сетевому адресу: https://ONVIBE.FUN/. Стороны Договора (Стороны) - это Продавец и Покупатель. Товар - это вещи, которые могут быть предметом договора купли-продажи, при условии соблюдения правил, предусмотренных статьей 129 Гражданского кодекса РФ.</span>
                </div>
                <div className="flex flex-col gap-y-3">
                    <span className="dark:text-slate-100 font-bold text-xl">Предмет Договора</span>
                    <span className="dark:text-slate-200 text-base">Договор купли-продажи заключается между Продавцом и Покупателем на условиях, изложенных в настоящей Оферте. Договор считается заключенным с момента совершения Сторонами действий, предусмотренных в Оферте. Товар - это вещи, которые могут быть предметом договора купли-продажи, при условии соблюдения правил, предусмотренных статьей 129 Гражданского кодекса РФ. Акцепт Оферты выражается в совершении конклюдентных действий, таких как регистрация на сайте Продавца, заполнение заявки на заказ Товара, сообщение требуемых для заключения Договора сведений, оплата Товара. Сайт Продавца в сети &quot;Интернет&quot; находится по адресу: https://ONVIBE.FUN/.</span>
                </div>
                <div className="flex flex-col gap-y-3">
                    <span className="dark:text-slate-100 font-bold text-xl">Права и обязанности Сторон</span>
                    <span className="dark:text-slate-200 text-base">Продавец имеет право требовать оплаты Товаров и их доставки в порядке и на условиях, предусмотренных Договором. Продавец может отказать в заключении Договора на основании настоящей Оферты Покупателю в случае его недобросовестного поведения. Продавец обязуется передать Покупателю Товар надлежащего качества и в надлежащей упаковке, передать Товар свободным от прав третьих лиц, организовать доставку Товаров Покупателю и предоставить Покупателю всю необходимую информацию. Покупатель имеет право требовать передачи Товара в порядке и на условиях, предусмотренным Договором, требовать предоставления всей необходимой информации, отказаться от Товара по основаниям, предусмотренным Договором и действующим законодательством Российской Федерации. Покупатель обязуется предоставить Продавцу достоверную информацию, принять и оплатить Товар в соответствии с условиями Договора.</span>
                </div>
                <div className="flex flex-col gap-y-3">
                    <span className="dark:text-slate-100 font-bold text-xl">Цена и порядок расчетов</span>
                    <span className="dark:text-slate-200 text-base">Стоимость товара и способы оплаты устанавливаются на основании данных Продавца при оформлении заказа Покупателем или на сайте Продавца по ссылке: https://ONVIBE.FUN/. Все платежи производятся безналичным способом.</span>
                </div>
                <div className="flex flex-col gap-y-3">
                    <span className="dark:text-slate-100 font-bold text-xl">Конфиденциальность и безопасность</span>
                    <span className="dark:text-slate-200 text-base">При выполнении данного Договора Стороны обеспечивают конфиденциальность и безопасность персональных данных в соответствии с применимыми законами, включая Федеральный закон от 27.07.2006 г. № 152-ФЗ &quot;О персональных данных&quot; и Федеральный закон от 27.07.2006 г. № 149-ФЗ &quot;Об информации, информационных технологиях и о защите информации&quot;. Стороны обязуются сохранять конфиденциальность полученной в ходе исполнения Договора информации и предпринимать все необходимые меры для её защиты от разглашения. Под конфиденциальной информацией понимается любая передаваемая в процессе реализации Договора информация, за исключением указанных исключений. Такая информация может быть представлена в различных документах, включая локальные нормативные акты, договоры, письма, отчеты и т.д., независимо от формата их представления.</span>
                </div>
                <div className="flex flex-col gap-y-3">
                    <span className="dark:text-slate-100 font-bold text-xl">Ответственность Сторон</span>
                    <span className="dark:text-slate-200 text-base">В случае неисполнения и/или ненадлежащего исполнения своих обязательств по Договору, Стороны несут ответственность в соответствии с условиями настоящей Оферты. Сторона, не исполнившая или ненадлежащим образом исполнившая обязательства по Договору, обязана возместить другой Стороне причиненные такими нарушениями убытки.</span>
                </div>
                <div className="flex flex-col gap-y-3">
                    <span className="dark:text-slate-100 font-bold text-xl">Срок действия настоящей Оферты</span>
                    <span className="dark:text-slate-200 text-base">Данная оферта вступает в силу с момента ее размещения на сайте Продавца и действует до тех пор, пока Продавец не отзовет её. Продавец оставляет за собой право вносить изменения в условия оферты или отзывать её в любое время по своему усмотрению. Уведомление об изменениях или отзыве оферты может быть размещено на сайте Продавца, в Личном кабинете Покупателя или отправлено на указанный Покупателем электронный или почтовый адрес. Договор вступает в силу с момента принятия условий оферты Покупателем и действует до полного исполнения сторонами своих обязательств по нему. Любые изменения, внесенные Продавцом и опубликованные на сайте в виде обновленной оферты, считаются принятыми Покупателем в полном объеме.</span>
                </div>
                <div className="flex flex-col gap-y-3">
                    <span className="dark:text-slate-100 font-bold text-xl">Реквизиты провайдера</span>
                    <span className="dark:text-slate-200 text-base">Полное наименование: Индивидуальный предприниматель Бекичев Кирилл Сергеевич ИНН 262810847515, ОГРН 325265100031062, onvibefun@gmail.com, оказывающий Услуги в соответствии с настоящими Правилами, как самостоятельно, так и с привлечением любых третьих лиц.</span>
                </div>
            </div>
        </div>
    )
}
